RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_eqdc.h
    kEQDC_SignalStatusAllFlags = kEQDC_SignalStatusRawHomeEnable | kEQDC_SignalStatusRawIndexPreset |
                                 kEQDC_SignalStatusRawPhaseB | kEQDC_SignalStatusRawPhaseA |
                                 kEQDC_SignalStatusFilteredHomeEnable | kEQDC_SignalStatusFilteredIndexPreset |
                                 kEQDC_SignalStatusFilteredPhaseB | kEQDC_SignalStatusFilteredPhaseA |
                                 kEQDC_SignalStatusPositionCompare0Flag | kEQDC_SignalStatusPositionCompare1Flag |
                                 kEQDC_SignalStatusPositionCompare2Flag | kEQDC_SignalStatusPositionCompare3Flag |
                                 kEQDC_SignalStatusCountDirectionFlagHold | kEQDC_SignalStatusCountDirectionFlag
};

/*!
 * @brief Interrupt enable/disable mask.
 * @anchor _eqdc_interrupt_enable
 */
enum _eqdc_interrupt_enable
{
    kEQDC_HomeEnableTransitionInterruptEnable =
        EQDC_CTRL_HIE_MASK,                                      /*!< HOME/ENABLE signal transition interrupt enable. */
    kEQDC_IndexPresetPulseInterruptEnable = EQDC_CTRL_XIE_MASK,  /*!< INDEX/PRESET pulse interrupt enable. */
    kEQDC_WatchdogTimeoutInterruptEnable  = EQDC_CTRL_WDIE_MASK, /*!< Watchdog timeout interrupt enable. */

    kEQDC_SimultPhaseChangeInterruptEnable = (uint32_t)EQDC_INTCTRL_SABIE_MASK
                                             << 16U, /*!< Simultaneous PHASEA and PHASEB change interrupt enable. */
    kEQDC_CountDirectionChangeInterruptEnable = (uint32_t)EQDC_INTCTRL_DIRIE_MASK
                                             << 16U, /*!< Count direction change interrupt enable. */
    kEQDC_PositionRollOverInterruptEnable = (uint32_t)EQDC_INTCTRL_ROIE_MASK << 16U, /*!< Roll-over interrupt enable. */
    kEQDC_PositionRollUnderInterruptEnable = (uint32_t)EQDC_INTCTRL_RUIE_MASK
                                             << 16U, /*!< Roll-under interrupt enable. */

    kEQDC_PositionCompare0InterruptEnable = (uint32_t)EQDC_INTCTRL_CMP0IE_MASK
                                           << 16U, /*!< Position compare 0 interrupt enable. */
    kEQDC_PositionCompare1InterruptEnable = (uint32_t)EQDC_INTCTRL_CMP1IE_MASK
                                           << 16U, /*!< Position compare 1 interrupt enable. */
    kEQDC_PositionCompare2InterruptEnable = (uint32_t)EQDC_INTCTRL_CMP2IE_MASK
                                           << 16U, /*!< Position compare 2 interrupt enable. */
    kEQDC_PositionCompare3InterruptEnable = (uint32_t)EQDC_INTCTRL_CMP3IE_MASK
                                           << 16U, /*!< Position compare 3 interrupt enable. */

    kEQDC_AllInterruptEnable = kEQDC_HomeEnableTransitionInterruptEnable | kEQDC_IndexPresetPulseInterruptEnable |
                               kEQDC_WatchdogTimeoutInterruptEnable | kEQDC_SimultPhaseChangeInterruptEnable |
                               kEQDC_CountDirectionChangeInterruptEnable | kEQDC_PositionRollOverInterruptEnable |
                               kEQDC_PositionRollUnderInterruptEnable | kEQDC_PositionCompare0InterruptEnable |
                               kEQDC_PositionCompare1InterruptEnable | kEQDC_PositionCompare2InterruptEnable |
                               kEQDC_PositionCompare3InterruptEnable
};

/*!
 * @brief Define HOME/ENABLE signal's trigger mode.
 */
typedef enum _eqdc_home_enable_init_pos_counter_mode
{
    /*! Don't use HOME/ENABLE signal to initialize the position counter. */
    kEQDC_HomeInitPosCounterDisabled = 0U,

    /*! Use positive going edge to trigger initialization of position counters. */
    kEQDC_HomeInitPosCounterOnRisingEdge = EQDC_CTRL_HIP_MASK,

    /*! Use negative going edge to trigger initialization of position counters. */
    kEQDC_HomeInitPosCounterOnFallingEdge = EQDC_CTRL_HIP_MASK | EQDC_CTRL_HNE_MASK,
} eqdc_home_enable_init_pos_counter_mode_t;

/*!
 * @brief Define INDEX/PRESET signal's trigger mode.
 */
typedef enum _eqdc_index_preset_init_pos_counter_mode
{
    /*! INDEX/PRESET pulse does not initialize the position counter. */
    kEQDC_IndexInitPosCounterDisabled = 0U,

    /*! Use INDEX/PRESET pulse rising edge to initialize position counter. */
    kEQDC_IndexInitPosCounterOnRisingEdge = EQDC_CTRL_XIP_MASK,

    /*! Use INDEX/PRESET pulse falling edge to initialize position counter. */
    kEQDC_IndexInitPosCounterOnFallingEdge = EQDC_CTRL_XIP_MASK | EQDC_CTRL_XNE_MASK,
} eqdc_index_preset_init_pos_counter_mode_t;

/*!
 * @brief Define type for decoder opertion mode.
 *
 * The Quadrature Decoder operates in following 4 operation modes:
 *   1.Quadrature Decode(QDC) Operation Mode (CTRL[PH1] = 0,CTRL2[OPMODE] = 0)
 *   In QDC operation mode, Module uses PHASEA, PHASEB, INDEX, HOME, TRIGGER
 *   and ICAP[3:1] to decode the PHASEA and PHASEB signals from Speed/Position sensor.
 *   2.Quadrature Count(QCT) Operation Mode (CTRL[PH1] = 0,CTRL2[OPMODE] = 1)
 *   In QCT operation mode, Module uses PHASEA, PHASEB, PRESET, ENABLE,
 *   TRIGGER and ICAP[3:1] to count the PHASEA and PHASEB signals from Speed/Position sensor.
 *   3.Single Phase Decode(PH1DC) Operation Mode (CTRL[PH1] = 1,CTRL2[OPMODE] = 0)
 *   In PH1DC operation mode, the module uses PHASEA, PHASEB, INDEX, HOME,
 *   TRIGGER and ICAP[3:1] to decode the PHASEA and PHASEB signals from Speed/Position sensor.
 *   4.Single Phase Count(PH1CT) Operation Mode (CTRL[PH1] = 1,CTRL2[OPMODE] = 1)
 *   In PH1CT operation mode, the module uses PHASEA, PHASEB, PRESET, ENABLE,
 *   TRIGGER and ICAP[3:1] to count the PHASEA and PHASEB signals from Speed/Position sensor.
 */
typedef enum _eqdc_operate_mode
{
    kEQDC_QuadratureDecodeOperationMode = 0U, /*!< Use standard quadrature decoder with PHASEA/PHASEB, INDEX/HOME. */
    kEQDC_QuadratureCountOperationMode,   /*!< Use quadrature count operation mode with PHASEA/PHASEB, PRESET/ENABLE. */
    kEQDC_SinglePhaseDecodeOperationMode, /*!< Use single phase quadrature decoder with PHASEA/PHASEB, INDEX/HOME. */
    kEQDC_SinglePhaseCountOperationMode,  /*!< Use single phase count decoder with PHASEA/PHASEB, PRESET/ENABLE. */
} eqdc_operate_mode_t;

/*!
 * @brief Define type for decoder count mode.
 *
 * In decode mode, it uses the standard quadrature decoder with PHASEA and PHASEB,
 * PHASEA = 0 and PHASEB = 0 mean reverse direction.
 *      - If PHASEA leads PHASEB, then motion is in the positive direction.
 *      - If PHASEA trails PHASEB,then motion is in the negative direction.
 * In single phase mode, there are three count modes:
 *      - In Signed Count mode (Single Edge). Both position counter (POS) and position difference counter (POSD) count
 *      on the input PHASEA rising edge while the input PHASEB provides the selected position counter direction
 * (up/down). If CTRL[REV] is 1, then the position counter will count in the opposite direction.
 *      - In Signed Count mode (double edge), both position counter (POS) and
 *      position difference counter (POSD) count the input PHASEA on both rising edge and falling edge while the input
 * PHASEB provides the selected position counter direction (up/down).
 *      - In UP/DOWN Pulse Count mode. Both position counter (POS) and position difference counter (POSD) count in the
 * up direction when input PHASEA rising edge occurs. Both counters count in the down direction when input PHASEB rising
 * edge occurs. If CTRL[REV] is 1, then the position counter will count in the opposite direction.
 */
typedef enum _eqdc_count_mode
{
    kEQDC_QuadratureX4 = 0U, /*!< Active on kEQDC_QuadratureDecodeOperationMode/kEQDC_QuadratureCountOperationMode. */
    kEQDC_QuadratureX2 = 1U, /*!< Active on kEQDC_QuadratureDecodeOperationMode/kEQDC_QuadratureCountOperationMode. */
    kEQDC_QuadratureX1 = 2U, /*!< Active on kEQDC_QuadratureDecodeOperationMode/kEQDC_QuadratureCountOperationMode. */
    kEQDC_UpDownPulseCount =
        0U, /*!< Active on kEQDC_SinglePhaseDecodeOperationMode/kEQDC_SinglePhaseCountOperationMode. */
    kEQDC_SignedCountDoubleEdge =
        1U, /*!< Active on kEQDC_SinglePhaseDecodeOperationMode/kEQDC_SinglePhaseCountOperationMode. */
    kEQDC_SignedCountSingleEdge =
        2U, /*!< Active on kEQDC_SinglePhaseDecodeOperationMode/kEQDC_SinglePhaseCountOperationMode. */
} eqdc_count_mode_t;

/*!
 * @brief Define type for the condition of POSMATCH pulses.
 */
typedef enum _eqdc_output_pulse_mode
{
    kEQDC_OutputPulseOnCounterEqualCompare = 0U, /*!< POSMATCH pulses when a match occurs between the position counters
                                                    (POS) and the compare value (UCOMPx/LCOMPx)(x range is 0-3). */
    kEQDC_OutputPulseOnReadingPositionCounter,   /*!< POSMATCH pulses when reading position counter(POS and LPOS),
                                                    revolution   counter(REV), position difference counter(POSD). */
} eqdc_output_pulse_mode_t;

/*!
 * @brief Define type for determining how the revolution counter (REV) is incremented/decremented.
 */
typedef enum _eqdc_revolution_count_condition
{
    kEQDC_RevolutionCountOnIndexPulse = 0U, /*!< Use INDEX pulse to increment/decrement revolution counter. */
    kEQDC_RevolutionCountOnRollOverModulus, /*!< Use modulus counting roll-over/under to increment/decrement revolution
                                              counter. */
} eqdc_revolution_count_condition_t;

/*!
 * @brief Input Filter Sample Count
 *
 * The Input Filter Sample Count represents the number of consecutive samples
 * that must agree, before the input filter accepts an input transition
 */
typedef enum _eqdc_filter_sample_count
{
    kEQDC_Filter3Samples  = 0U, /*!< 3  samples. */
    kEQDC_Filter4Samples  = 1U, /*!< 4  samples. */
    kEQDC_Filter5Samples  = 2U, /*!< 5  samples. */
    kEQDC_Filter6Samples  = 3U, /*!< 6  samples. */
    kEQDC_Filter7Samples  = 4U, /*!< 7  samples. */
    kEQDC_Filter8Samples  = 5U, /*!< 8  samples. */
    kEQDC_Filter9Samples  = 6U, /*!< 9  samples. */
    kEQDC_Filter10Samples = 7U, /*!< 10 samples. */
} eqdc_filter_sample_count_t;

/*!
 * @brief Count direction.
 */
typedef enum _eqdc_count_direction_flag
{
    kEQDC_CountDirectionDown = 0U, /*!< Last count was in down direction. */
    kEQDC_CountDirectionUp,        /*!< Last count was in up direction. */
} eqdc_count_direction_flag_t;

/*!
 * @brief Prescaler used by Last Edge Time (LASTEDGE) and
 * Position Difference Period Counter (POSDPER).
 */
typedef enum _eqdc_prescaler
{
    kEQDC_Prescaler1     = 0U,  /*!< Prescaler value 1. */
    kEQDC_Prescaler2     = 1U,  /*!< Prescaler value 2. */
    kEQDC_Prescaler4     = 2U,  /*!< Prescaler value 4. */
    kEQDC_Prescaler8     = 3U,  /*!< Prescaler value 8. */
    kEQDC_Prescaler16    = 4U,  /*!< Prescaler value 16. */
    kEQDC_Prescaler32    = 5U,  /*!< Prescaler value 32. */
    kEQDC_Prescaler64    = 6U,  /*!< Prescaler value 64. */
    kEQDC_Prescaler128   = 7U,  /*!< Prescaler value 128. */
    kEQDC_Prescaler256   = 8U,  /*!< Prescaler value 256. */
    kEQDC_Prescaler512   = 9U,  /*!< Prescaler value 512. */
    kEQDC_Prescaler1024  = 10U, /*!< Prescaler value 1024. */
    kEQDC_Prescaler2048  = 11U, /*!< Prescaler value 2048. */
    kEQDC_Prescaler4096  = 12U, /*!< Prescaler value 4096. */
    kEQDC_Prescaler8192  = 13U, /*!< Prescaler value 8192. */
    kEQDC_Prescaler16384 = 14U, /*!< Prescaler value 16384. */
    kEQDC_Prescaler32768 = 15U, /*!< Prescaler value 32768. */
} eqdc_prescaler_t;

/*!
 * @brief Define user configuration structure for EQDC module.
 */
typedef struct _eqdc_config
{
    /* Basic counter. */
    bool enableReverseDirection; /*!< Enable reverse direction counting. */
    bool countOnce;              /*!< Selects modulo loop or one shot counting mode.  */

