RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_eqdc.h
    bool enableDma;                /*!< Enable DMA for new written buffer values of COMPx/INIT/MOD(x range is 0-3) */
    bool bufferedRegisterLoadMode; /*!<selects the loading time point of the buffered compare registers UCOMPx/LCOMPx,
                                       x=0~3, initial register (UINIT/LINIT), and modulus register (UMOD/LMOD). */

    bool enableTriggerInitPositionCounter;    /*!< Initialize position counter with initial register(UINIT, LINIT) value
                                               on TRIGGER's rising edge. */

#if (defined(FSL_FEATURE_EQDC_CTRL2_HAS_EMIP_BIT_FIELD) && FSL_FEATURE_EQDC_CTRL2_HAS_EMIP_BIT_FIELD)
 /*!
 * Enables the feature that the position counter to be initialized by Index Event Edge Mark.
 *
 * This option works together with @ref _eqdc_index_preset_init_pos_counter_mode and @ref enableReverseDirection;
 * If enabled, the behavior is like this:
 *
 * When PHA leads PHB (Clockwise):
 *   If @ref _eqdc_index_preset_init_pos_counter_mode is @ref kEQDC_IndexInitPosCounterOnRisingEdge,
 *   then INDEX rising edge reset position counter.
 *   If @ref _eqdc_index_preset_init_pos_counter_mode is @ref kEQDC_IndexInitPosCounterOnFallingEdge,
 *   then INDEX falling edge reset position counter.
 *   If @ref enableReverseDirection is false, then Reset position counter to initial value.
 *   If @ref enableReverseDirection is true, then reset position counter to modulus value.
 *
 * When PHA lags PHB (Counter Clockwise):
 *   If @ref _eqdc_index_preset_init_pos_counter_mode is @ref kEQDC_IndexInitPosCounterOnRisingEdge,
 *   then INDEX falling edge reset position counter.
 *   If @ref _eqdc_index_preset_init_pos_counter_mode is @ref kEQDC_IndexInitPosCounterOnFallingEdge,
 *   then INDEX rising edge reset position counter.
 *   If @ref enableReverseDirection is false, then Reset position counter to modulus value.
 *   If @ref enableReverseDirection is true, then reset position counter to initial value.
 */
    bool enableIndexInitPositionCounter;
#endif /* FSL_FEATURE_EQDC_CTRL2_HAS_EMIP_BIT_FIELD */

    bool enableTriggerClearPositionRegisters; /*!< Clear position counter(POS), revolution counter(REV), position
                                                difference counter (POSD) on TRIGGER's rising edge. */
    bool enableTriggerHoldPositionRegisters;  /*!< Load position counter(POS), revolution counter(REV), position
                                                difference counter (POSD) values to hold registers  on TRIGGER's rising
                                                edge. */

    bool filterPhaseA; /*!< Filter operation on PHASEA input, when write 1, it means filter for PHASEA input is
                           bypassed. */
    bool filterPhaseB; /*!< Filter operation on PHASEB input, when write 1, it means filter for PHASEB input is
                           bypassed. */
    bool filterIndPre; /*!< Filter operation on INDEX/PRESET input, when write 1, it means filter for INDEX/PRESET
                           input is bypassed. */
    bool filterHomEna; /*!< Filter operation on HOME/ENABLE input, when write 1, it means filter for  HOME/ENABLE input
                           is bypassed. */

    /* Watchdog. */
    bool enableWatchdog;           /*!< Enable the watchdog to detect if the target is moving or not. */
    uint16_t watchdogTimeoutValue; /*!< Watchdog timeout count value. It stores the timeout count for the quadrature
                                        decoder module watchdog timer. */

    /* Filter for input signals: PHASEA, PHASEB, INDEX and HOME. */
    eqdc_prescaler_t prescaler;                   /*!< Prescaler. */
    bool filterClockSourceselection;              /*!< Filter Clock Source selection. */
    eqdc_filter_sample_count_t filterSampleCount; /*!< Input Filter Sample Count. This value should be chosen to reduce
                               the probability of noisy samples causing an incorrect transition to be recognized. The
                               value represent the number of consecutive samples that must agree prior to the input
                               filter accepting an input transition. */
    uint8_t filterSamplePeriod; /*!< Input Filter Sample Period. This value should be set such that the sampling
                                     period is larger than the period of the expected noise. This value represents the
                                      sampling period (in IPBus clock cycles) of the decoder input signals.
                                      The available range is 0 - 255. */

    /* Operate mode. */
    eqdc_operate_mode_t operateMode; /*!< Selects operation mode. */
    eqdc_count_mode_t countMode;     /*!< Selects count mode. */

    /* Signal detection. */
    eqdc_home_enable_init_pos_counter_mode_t homeEnableInitPosCounterMode;   /*!< Select how HOME/Enable signal used to
                                                                  initialize position counters. */
    eqdc_index_preset_init_pos_counter_mode_t indexPresetInitPosCounterMode; /*!< Select how INDEX/Preset signal used
                                                                  to initialize position counters. */

    /* Position compare. */
    eqdc_output_pulse_mode_t outputPulseMode; /*!< The condition of POSMATCH pulses. */
    uint32_t positionCompareValue[4]; /*!< Position compare 0 ~ 3 value. The available value is a 32-bit number.*/

    /* Modulus counting. */
    eqdc_revolution_count_condition_t revolutionCountCondition; /*!< Revolution Counter Modulus Enable. */
    uint32_t positionModulusValue; /*!< Position modulus value. The available value is a 32-bit number. */
    uint32_t positionInitialValue; /*!< Position initial value. The available value is a 32-bit number. */
    uint32_t positionCounterValue; /*!< Position counter value. When Modulo mode enabled, the positionCounterValue
                                           should be in the range of @ref positionInitialValue and
                                           @ref positionModulusValue. */

    /* Period measurement. */
    bool enablePeriodMeasurement; /*!< Enable period measurement. When enabled, the position difference hold register
                                      (POSDH) is only updated when position difference register (POSD) is read. */

    /* Interrupts. */
    uint16_t enabledInterruptsMask; /*!< Mask of interrupts to be enabled, should be OR'ed value of @ref
                                          _eqdc_interrupt_enable. */
} eqdc_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

