RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_eqdc.h
    u32Pos = base->UPOSH3; /* Get upper 16 bits from hold register. */
    u32Pos <<= 16U;
    u32Pos |= base->LPOSH3; /* Get lower 16 bits from hold register. */

    return u32Pos;
}

/*!
 * @brief  Get the position difference counter's value.
 *
 * @param  base EQDC peripheral base address.
 * @return The position difference counter's value.
 */
static inline uint16_t EQDC_GetPositionDifference(EQDC_Type *base)
{
    return base->POSD;
}

/*!
 * @brief  Get the hold position difference counter's value.
 *
 * The position difference (POSD) value is loaded to hold position difference (POSDH)
 * when:
 * 1. Position register (POS or UPOS, LPOS), or position difference register (POSD),
 * or revolution register (REV) is read. When Period Measurement is enabled (CTRL3[PMEN] = 1),
 * POSDH will only be udpated when reading POSD.
 * 2. TRIGGER happens and TRIGGER is enabled to update the hold registers.
 *
 * @param  base EQDC peripheral base address.
 * @return  Hold position difference counter's value.
 */
static inline uint16_t EQDC_GetHoldPositionDifference(EQDC_Type *base)
{
    return base->POSDH;
}

/*!
 * @brief  Get the revolution counter's value.
 *
 * Get the revolution counter (REV) value.
 *
 * @param  base EQDC peripheral base address.
 * @return  The revolution counter's value.
 */
static inline uint16_t EQDC_GetRevolution(EQDC_Type *base)
{
    return base->REV;
}

/*!
 * @brief  Get the hold revolution counter's value.
 *
 * The revolution counter (REV) value is loaded to hold revolution (REVH)
 * when:
 * 1. Position register (POS or UPOS, LPOS), or position difference register (POSD),
 * or revolution register (REV) is read.
 * 2. TRIGGER happens and TRIGGER is enabled to update the hold registers.
 *
 * @param  base EQDC peripheral base address.
 * @return Hold position revolution counter's value.
 */
static inline uint16_t EQDC_GetHoldRevolution(EQDC_Type *base)
{
    return base->REVH;
}

/*!
 * @brief  Get the last edge time.
 *
 * Last edge time (LASTEDGE) is the time since the last edge occurred on PHASEA or PHASEB.
 * The last edge time register counts up using the peripheral clock after prescaler.
 * Any edge on PHASEA or PHASEB will reset this register to 0 and start counting.
 * If the last edge timer count reaches 0xffff, the counting will stop in order to
 * prevent an overflow.Counting will continue when an edge occurs on
 * PHASEA or PHASEB.
 *
 * @param  base EQDC peripheral base address.
 *
 * @return The last edge time.
 */
static inline uint16_t EQDC_GetLastEdgeTime(EQDC_Type *base)
{
    return base->LASTEDGE;
}

/*!
 * @brief  Get the hold last edge time.
 *
 * The hold of last edge time(LASTEDGEH) is update to last edge time(LASTEDGE)
 * when the position difference register register (POSD) is read.
 *
 * @param  base EQDC peripheral base address.
 * @return Hold of last edge time.
 */
static inline uint16_t EQDC_GetHoldLastEdgeTime(EQDC_Type *base)
{
    return base->LASTEDGEH;
}

/*!
 * @brief Get the Position Difference Period counter value
 *
 * The Position Difference Period counter (POSDPER) counts up using the
 * prescaled peripheral clock.  When reading the position difference register(POSD),
 * the last edge time (LASTEDGE) will be loaded to position difference period counter(POSDPER).
 * If the POSDPER count reaches 0xffff, the counting will stop in order to prevent an
 * overflow. Counting will continue when an edge occurs on PHASEA or PHASEB.
 *
 * @param  base EQDC peripheral base address.
 * @return The position difference period counter value.
 */
static inline uint16_t EQDC_GetPositionDifferencePeriod(EQDC_Type *base)
{
    return base->POSDPER;
}

/*!
 * @brief Get buffered Position Difference Period counter value
 *
 * The Bufferd Position Difference Period (POSDPERBFR) value is updated with
 * the position difference period counter(POSDPER) when any edge occurs
 * on PHASEA or PHASEB.
 *
 * @param  base EQDC peripheral base address.
 * @return The buffered position difference period counter value.
 */
static inline uint16_t EQDC_GetBufferedPositionDifferencePeriod(EQDC_Type *base)
{
    return base->POSDPERBFR;
}

/*!
 * @brief Get Hold Position Difference Period counter value
 *
 * The hold position difference period(POSDPERH) is updated with the value of
 * buffered position difference period(POSDPERBFR) when the
 * position difference(POSD) register is read.
 *
 * @param  base EQDC peripheral base address.
 * @return The hold position difference period counter value.
 */
static inline uint16_t EQDC_GetHoldPositionDifferencePeriod(EQDC_Type *base)
{
    return base->POSDPERH;
}

/*! @} */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _FSL_EQDC_H_ */
